<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"staging","backend":"130724c27947ecaf0b5c2ad8d27c1136d65d51999047e4f87209fce9f79c6572","plan_job_ref":"Job Pull Request Checks #4859 at https://github.com/GSA-TTS/FAC/actions/runs/15943194863","plan_out_hash":"7319917b37531f6cbd01aca2fab3d19c7ace84ae1a57981fda666367d044076f","plan_hash":"217b8fec56310b18ce3e7c28e2a552f3efd68af2dea33de465d7b36a5a333798","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 1 to add, 2 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.staging.cloudfoundry_app.postgrest will be updated in-place
!~  resource "cloudfoundry_app" "postgrest" {
+       buildpacks                  = (known after apply)
!~      created_at                  = "2025-04-21T19:51:54Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> "256M"
!~      enable_ssh                  = false -> (known after apply)
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
!~      memory                      = "2048M" -> "512M"
        name                        = "postgrest"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-staging-postgrest.app.cloud.gov" -> null
            },
        ] -> (known after apply)
!~      stack                       = null -> (known after apply)
!~      updated_at                  = "2025-06-27T12:29:10Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.staging.cloudfoundry_route.postgrest will be updated in-place
!~  resource "cloudfoundry_route" "postgrest" {
!~      destinations = [
-           {
-               app_id           = "52191574-dff1-47b7-888c-bd8ef8de3135" -> null
-               app_process_type = "web" -> null
-               id               = "97514684-4b86-4327-acfa-b2f1f7f5efb1" -> null
-               port             = 3000 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "caf12fc2-60a3-412b-b919-2416179b271e"
!~      updated_at   = "2025-04-21T19:51:59Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.staging.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-06-27T10:38:05Z" -> (known after apply)
        }
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #4859](https://github.com/GSA-TTS/FAC/actions/runs/15943194863)